{"class_name": "Model", "keras_version": "2.2.2", "config": {"layers": [{"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 128, 6], "name": "input_10", "sparse": false}, "inbound_nodes": [], "name": "input_10"}, {"class_name": "Bidirectional", "config": {"merge_mode": "concat", "layer": {"class_name": "LSTM", "config": {"recurrent_activation": "hard_sigmoid", "trainable": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "use_bias": true, "bias_regularizer": null, "return_state": false, "unroll": false, "activation": "tanh", "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 50, "unit_forget_bias": true, "activity_regularizer": null, "recurrent_dropout": 0.1, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "kernel_constraint": null, "dropout": 0.0, "stateful": false, "recurrent_regularizer": null, "name": "lstm_10", "bias_constraint": null, "go_backwards": false, "implementation": 1, "kernel_regularizer": null, "return_sequences": true, "recurrent_constraint": null}}, "trainable": true, "name": "bidirectional_10"}, "inbound_nodes": [[["input_10", 0, 0, {}]]], "name": "bidirectional_10"}, {"class_name": "Bidirectional", "config": {"merge_mode": "concat", "layer": {"class_name": "LSTM", "config": {"recurrent_activation": "hard_sigmoid", "trainable": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "use_bias": true, "bias_regularizer": null, "return_state": false, "unroll": false, "activation": "tanh", "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 100, "unit_forget_bias": true, "activity_regularizer": null, "recurrent_dropout": 0.1, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "kernel_constraint": null, "dropout": 0.0, "stateful": false, "recurrent_regularizer": null, "name": "lstm_11", "bias_constraint": null, "go_backwards": false, "implementation": 1, "kernel_regularizer": null, "return_sequences": true, "recurrent_constraint": null}}, "trainable": true, "name": "bidirectional_11"}, "inbound_nodes": [[["bidirectional_10", 0, 0, {}]]], "name": "bidirectional_11"}, {"class_name": "TimeDistributed", "config": {"layer": {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_8", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 50, "use_bias": true, "activity_regularizer": null}}, "trainable": true, "name": "time_distributed_8"}, "inbound_nodes": [[["bidirectional_11", 0, 0, {}]]], "name": "time_distributed_8"}, {"class_name": "CRF", "config": {"trainable": true, "use_bias": true, "chain_regularizer": null, "bias_regularizer": null, "boundary_constraint": null, "unroll": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 12, "use_boundary": true, "test_mode": "viterbi", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "kernel_constraint": null, "boundary_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "boundary_regularizer": null, "name": "crf_7", "learn_mode": "join", "bias_constraint": null, "chain_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "kernel_regularizer": null, "input_dim": 50, "chain_constraint": null, "sparse_target": false}, "inbound_nodes": [[["time_distributed_8", 0, 0, {}]]], "name": "crf_7"}], "input_layers": [["input_10", 0, 0]], "output_layers": [["crf_7", 0, 0]], "name": "model_7"}, "backend": "tensorflow"}